package com.ruru.plastic.user.enume;

public enum NotifyCodeEnum {
    异地登录("401","您的账号在其他设备登录！"),
    有人评论("501", "有人评价了您的信息"),
    有人回帖("502", "有人回复了您的评论"),
    有人点赞("503", "有人点赞了您的评论"),
    库存_待审核_管理("821","有新的库存待审核，请及时处理！"),
    库存_审核通过("822","您的库存被审核通过！"),
    库存_审核不通过("823","您的库存未能通过审核，请编辑后再提交！"),
    库存_审核展示中("824","您的库存已展示成功！"),
    库存_新库存("825","您有新的库存，请及时查看！"),

    询价_待审核_管理("801","有新的询价待审核，请及时处理！"),
    询价_审核通过("802","您的询价被审核通过！"),
    询价_审核不通过("803","您的询价未能通过审核，请编辑后再提交！"),
    询价_审核展示中("804","您的询价已展示成功！"),
    询价_新询价("805","您有新的询价，请及时查看！"),
    企业认证_待审核_管理("806","您有新的企业认证，请及时查看！"),
    企业认证_审核通过("807","您的企业认证被审核通过！"),
    企业认证_审核不通过("808","您的企业认证，未能通过审核，请修改后再提交！"),
    个人认证_待审核_管理("809","您有新的企业认证，请及时查看！"),
    个人认证_审核通过("810","您的企业认证被审核通过！"),
    个人认证_审核不通过("811","您的个人认证，未能通过审核，请修改后再提交！"),
    蓝V认证_待审核_管理("809","您有新的蓝V认证，请及时查看！"),
    蓝V认证_审核通过("810","您的蓝V认证被审核通过！"),
    蓝V认证_审核不通过("811","您的蓝V认证，未能通过审核，请修改后再提交！"),
    报价_创建("901","您的询盘有新的报价，请及时查看"),
    报价_更新("902","您的询盘有报价更新，请及时查看"),
    报价_撤回("903","您的询盘有报价撤销，请及时查看"),
    报价_中标("904","您的报价已中标，请及时查看"),
    报价_未中标("905","您的报价未中标，请及时查看"),
    砍价_创建("906","您的询盘有新的砍价，请及时查看"),
    砍价_更新("907","您的询盘有砍价更新，请及时查看"),
    砍价_撤回("908","您的询盘有砍价撤销，请及时查看"),
    ;
    private final String code;
    private final String content;

    NotifyCodeEnum(String code, String content) {
        this.code = code;
        this.content = content;
    }
    public String getCode() {
        return code;
    }

    public String getContent() {
        return content;
    }
}
